In [22]:
import pandas as pd
df = pd.read_csv("practice_day.csv", on_bad_lines='skip')
df

  EmployeeID EmployeeName   Age   Salary  Price  Marks1  Marks2  Marks3
0       E101        Alice  25.0  50000.0   1200      85      90      88
1       E103      Charlie  22.0  52000.0   1100      92      95      90
2       E101        Alice  25.0  50000.0   1200      85      90      88
3       E104        David  45.0  80000.0   2500      88      85      89
4       E105          Eve  29.0  58000.0   1300      76      79      81
5       E106        Frank   NaN  75000.0   2200      90      91      92
6       E107        Grace  34.0      NaN   1900      81      83      80
7       E108        Heidi  38.0      NaN   1800      84      86      88
8       E109         Ivan  26.0  53000.0   1400      95      92      94

In [19]:
print(df.columns)

Index(['EmployeeID', 'EmployeeName', 'Age', 'Salary', 'Price', 'Marks1',
       'Marks2', 'Marks3'],
      dtype='object')

In [21]:
df['Discounted Price'] =df['Price']* 0.9

df.head()

,EmployeeID,EmployeeName,Age,Salary,Price,Marks1,Marks2,Marks3,Discounted Price
0,E101,Alice,25.0,50000.0,1200,85,90,88,1080.0
1,E103,Charlie,22.0,52000.0,1100,92,95,90,990.0
2,E101,Alice,25.0,50000.0,1200,85,90,88,1080.0
3,E104,David,45.0,80000.0,2500,88,85,89,2250.0
4,E105,Eve,29.0,58000.0,1300,76,79,81,1170.0